yavtuk/stm32f429disco/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_tx;
__IO ITStatus UartReady = RESET;

osThreadId defaultTaskHandle;
osThreadId mySender1Handle;
osThreadId mySender2Handle;
osThreadId mySender3Handle;
osThreadId mySender4Handle;
osThreadId mySender5Handle;
osThreadId mySender6Handle;
osThreadId mySender7Handle;
osThreadId mySender8Handle;
osThreadId mySender9Handle;
osThreadId mySender10Handle;



osMessageQId myQueue01Handle;
typedef struct
{
    uint8_t *ptr;
    size_t size;
}__print_msg;


/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
void StartDefaultTask(void const * argument);
void StartTask01(void const * argument);
void StartTask02(void const * argument);
void StartTask03(void const * argument);
void StartTask04(void const * argument);
void StartTask05(void const * argument);
void StartTask06(void const * argument);
void StartTask07(void const * argument);
void StartTask08(void const * argument);
void StartTask09(void const * argument);
void StartTask10(void const * argument);

int main(void)
{
  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of mySender1 */
  osThreadDef(mySender1, StartTask01, osPriorityNormal, 0, 128);
  mySender1Handle = osThreadCreate(osThread(mySender1), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender2, StartTask02, osPriorityNormal, 0, 128);
  mySender2Handle = osThreadCreate(osThread(mySender2), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender3, StartTask03, osPriorityNormal, 0, 128);
  mySender3Handle = osThreadCreate(osThread(mySender3), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender4, StartTask04, osPriorityNormal, 0, 128);
  mySender4Handle = osThreadCreate(osThread(mySender4), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender5, StartTask05, osPriorityNormal, 0, 128);
  mySender5Handle = osThreadCreate(osThread(mySender5), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender6, StartTask06, osPriorityNormal, 0, 128);
  mySender6Handle = osThreadCreate(osThread(mySender6), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender7, StartTask07, osPriorityNormal, 0, 128);
  mySender7Handle = osThreadCreate(osThread(mySender7), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender8, StartTask08, osPriorityNormal, 0, 128);
  mySender8Handle = osThreadCreate(osThread(mySender8), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender9, StartTask09, osPriorityNormal, 0, 128);
  mySender9Handle = osThreadCreate(osThread(mySender9), NULL);

  /* definition and creation of mySender2 */
  osThreadDef(mySender10, StartTask10, osPriorityNormal, 0, 128);
  mySender10Handle = osThreadCreate(osThread(mySender10), NULL);

  /* Create the queue(s) */
  /* definition and creation of myQueue01 */
  osMessageQDef(myQueue01, 5, __print_msg);
  myQueue01Handle = osMessageCreate(osMessageQ(myQueue01), NULL);
  /* Start scheduler */
  osKernelStart();
  
  while (1)
  {
  }
}

