yavtuk/stm32f429disco/Src/main.c
  /*Configure GPIO pins : G7_Pin B2_Pin */
  GPIO_InitStruct.Pin = G7_Pin|B2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : G3_Pin B4_Pin */
  GPIO_InitStruct.Pin = G3_Pin|B4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF9_LTDC;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : LD3_Pin LD4_Pin */
  GPIO_InitStruct.Pin = LD3_Pin|LD4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : SDCKE1_Pin SDNE1_Pin */
  GPIO_InitStruct.Pin = SDCKE1_Pin|SDNE1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF12_FMC;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}


/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
  __print_msg msg;
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
      xQueueReceive( myQueue01Handle, &msg, osWaitForever );
      if(HAL_UART_Transmit_DMA(&huart1, msg.ptr, msg.size) != HAL_OK)
      {
        Error_Handler();
      }

      while( UartReady != SET) {}
      UartReady = RESET;
  }
  /* USER CODE END 5 */ 
}
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    HAL_GPIO_TogglePin(GPIOG, LD4_Pin);
    UartReady = SET;
    __HAL_UART_FLUSH_DRREGISTER(&huart1);
    HAL_UART_DMAStop(&huart1);
}
/* StartTask02 function */
void StartTask01(void const * argument)
{
  uint8_t msg[128];
  memset(msg, '*', 126);
  msg[126] = '\r';
  msg[127] = '\n';
  __print_msg msgTask1;
  msgTask1.ptr = msg;
  msgTask1.size = 128;
  for(;;)
  {
      xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
      osDelay(1);
  }

}

void StartTask02(void const * argument)
{
    uint8_t msg[128];
    memset(msg, '=', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }

}
void StartTask03(void const * argument)
{
    uint8_t msg[128];
    memset(msg, '3', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }

}
void StartTask04(void const * argument)
{
    uint8_t msg[128];
    memset(msg, '4', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }

}

void StartTask05(void const * argument)
{
    uint8_t msg[128];
    memset(msg, '5', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }
}

void StartTask06(void const * argument)
{
    uint8_t msg[128];
    memset(msg, '<', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }
}
void StartTask07(void const * argument)
{
    uint8_t msg[128];
    memset(msg, '>', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }
}

void StartTask08(void const * argument)
{
    uint8_t msg[128];
    memset(msg, '\\', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }
}

void StartTask09(void const * argument)
{
    uint8_t msg[128];
    memset(msg, '/', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }
}
void StartTask10(void const * argument)
{
    uint8_t msg[128];
    memset(msg, 'A', 126);
    msg[126] = '\r';
    msg[127] = '\n';
    __print_msg msgTask1;
    msgTask1.ptr = msg;
    msgTask1.size = 128;
    for(;;)
    {
        xQueueSend( myQueue01Handle, &msgTask1, osWaitForever );
        osDelay(1);
    }
}
/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
